{
    "projects": [
        {
            "name": "3D Path Planning for Power-Optimized Aerial Object Detection With Reinforcement Learning",
            "description": "Unmanned aerial vehicles are increasingly employed for exploratory missions in outdoor environments. In the majority of these missions, such as anomaly detection in large farms, the distribution of the target objects is unknown. Hence, today's commercial UAVs usually follow a complete coverage flight plan to obtain an orthomosaic of the entire search domain prior to object detection. This work presents a generalizable and device-agnostic path planning framework that provides a 3-dimensional navigation plan based on the pattern of the detected targets and the wind field at the time of flight. The user starts with an aerial or satellite image of the survey area, and the application will provide a path for the drone using the flight-time wind field. The Advantage Actor-Critic method was initially implemented in low-fidelity gym environments to learn from the combination of drone navigation physics and its perception module. A dataset of Near-Infrared (NIR) was created by flying over multiple soccer fields on various days to train the object detector on real-world data. An automated annotation method, Double-clustering, was developed to localize plant anomalies. This preprocessing method enabled training of a retina network, which reduced the inference time of the perception module from an average of 0.656 s to 0.04 s. The developed framework was tested with real-time reading of the wind field, and the number of detected anomalies was compared to the benchmark pathing of the same drone. During a single battery life, the proposed IP4 architecture could detect about three times the number of goal objects compared to the state- of-the-art algorithm in various wind speeds. We demonstrate that, the Integrated Power and perception Path Planning (IP4) can outperform the complete coverage solution even if a prior map is not provided.",
            "image": "drone_path.png",
            "code": "https://github.com/AmirNiaraki/drone_gym",
            "papers": [
                {
                    "title": "Maximizing Aerial Detection of Organic Objects in Non-Exhaustively Searchable Survey Area",
                    "url": "https://openaccess.thecvf.com/content/CVPR2025W/V4A/papers/Niaraki_Maximizing_aerial_detection_of_organic_objects_in_non-exhaustively_searchable_survey_CVPRW_2025_paper.pdf",
                    "type": "Conference",
                    "year": 2025
                },
                {
                    "title": "Energy-Aware 3D Path Planning via Reinforcement Learning for Aerial Object Detection and Mapping",
                    "url": "https://lib.dr.iastate.edu/etd/2024/",
                    "type": "Thesis",
                    "year": 2024
                },
                {
                    "title": "A Vision Based Deep Reinforcement Learning Algorithm for UAV Obstacle Avoidance",
                    "url": "https://link.springer.com/chapter/10.1007/978-3-030-82193-7_8",
                    "type": "Conference",
                    "year": 2021
                },
                {
                    "title": "Visual Exploration and Energy-Aware Path Planning via Reinforcement Learning",
                    "url": "https://arxiv.org/abs/1909.12217",
                    "type": "Preprint",
                    "year": 2019
                }
            ],
            "gallery": null,
            "start_year": 2023,
            "end_year": null,
            "tags": [
                "RL",
                "Aerial Object Detection",
                "Path Planning"
            ]
        },
        {
            "name": "Automatic Umpiring System",
            "description": "We designed a stereo vision system to detect the ball during a baseball game, map the field with sub-inch accuracy, measure the batter’s size using pose models, and ultimately make strike and ball calls faster and more precisely than a human umpire!",
            "image": "trajectory.png",
            "code": null,
            "papers": [
                {
                    "title": "Automatic Umpiring System",
                    "url": "https://patents.google.com/patent/US20240173608A1",
                    "type": "Patent",
                    "year": 2024
                }
            ],
            "gallery": null,
            "start_year": 2022,
            "end_year": null,
            "tags": [
                "Patent"
            ]
        },
        {
            "name": "Rat Dopaminergic Neurons on a Chip!",
            "description": "We made a microelectrode array with graphene for high-resolution, real-time monitoring of neural cell activity. We then designed methodology to monitor their visual and electrochemical activity under damage and growth conditions.",
            "image": "3d_graphene_2019.png",
            "code": null,
            "papers": [
                {
                    "title": "Capacitance of Flexible Polymer/Graphene Microstructures With High Mechanical Strength",
                    "url": "https://www.liebertpub.com/doi/10.1089/3dp.2023.0001",
                    "type": "Journal",
                    "year": 2023
                },
                {
                    "title": "Minute-Sensitive Real-Time Monitoring of Neural Cells Through Printed Graphene Microelectrodes",
                    "url": "https://www.sciencedirect.com/science/article/pii/S0956566322001234",
                    "type": "Journal",
                    "year": 2022
                },
                {
                    "title": "Electrochemical Characterization of Dopamine in Neural Cells With Flexible Biosensors",
                    "url": "https://asmedigitalcollection.asme.org/manufacturingscience/article/144/9/091009/1147001",
                    "type": "Journal",
                    "year": 2022
                },
                {
                    "title": "High-Yield Production of Aqueous Graphene for Electrohydrodynamic Drop-on-Demand Printing of Biocompatible Conductive Patterns",
                    "url": "https://www.mdpi.com/2079-6374/10/1/6",
                    "type": "Journal",
                    "year": 2020
                },
                {
                    "title": "Viability of Neural Cells on 3D Printed Graphene Bioelectronics",
                    "url": "https://www.mdpi.com/2079-6374/9/4/112",
                    "type": "Journal",
                    "year": 2019
                }
            ],
            "gallery": null,
            "start_year": 2018,
            "end_year": 2023,
            "tags": [
                "Journal"
            ]
        },
        {
            "name": "Fabrication of Flexible Biosensors for interaction with Glial and Neural Cells",
            "description": "We first employed a microfluidic technique to create a water-based, highly conductive graphene solution to serve as a conductive ink. We then designed an electrohydrodynamic inkjet printing technique to construct biocompatible and flexible electrodes. These conductive patterns were used in our development of conductive hollow microfibers for three-dimensional encapsulation and electrical stimulation of astrocyte cells along with Rat N27 Dopaminergic Neurons.",
            "image": "cells_graphene.png",
            "code": null,
            "papers": [
                {
                    "title": "Fabrication of Conductive Hollow Microfibers for Encapsulation of Astrocyte Cells",
                    "url": "https://www.biorxiv.org/content/10.1101/2022.03.09.483669v1",
                    "type": "Preprint",
                    "year": 2022
                },
                {
                    "title": "Enhancing the Conductivity of Cell-Laden Alginate Microfibers With Aqueous Graphene for Neural Applications",
                    "url": "https://www.frontiersin.org/articles/10.3389/fmats.2020.00061/full",
                    "type": "Journal",
                    "year": 2020
                },
                {
                    "title": "Behavior of Neural Cells Post Manufacturing and After Prolonged Encapsulation Within Conductive Graphene-Laden Alginate Microfibers",
                    "url": "https://onlinelibrary.wiley.com/doi/10.1002/adbi.202101026",
                    "type": "Journal",
                    "year": 2021
                }
            ],
            "gallery": null,
            "start_year": 2020,
            "end_year": 2022,
            "tags": [
                "Preprint",
                "Journal"
            ]
        },

        {
            "name": "Characterization of Syngas Combustion in Intersecting Burners Using the Interferometry Method",
            "description": "Inserting physical probes for temperature measurement will influence the flow field, therefore we designed a vision based experiment setup to estimate the temperature and flame structure based on interferometry method.",
            "image": "interferrometry_2017.png",
            "code": null,
            "papers": [
                {
                    "title": "Characterization of Syngas Combustion in Intersecting Burners Using the Interferometry Method",
                    "url": "https://pubs.acs.org/doi/10.1021/acs.energyfuels.7b01612",
                    "type": "Journal",
                    "year": 2017
                }
            ],
            "gallery": null,
            "start_year": 2015,
            "end_year": 2017,
            "tags": [
                "Journal"
            ]
        }
    ]
}